app/Http/Controllers/AdminFeedbackController.php

SELECT * FROM `feedback`
SELECT * FROM `pertanyaans` WHERE `pertanyaans`.`pertanyaan_id` in (13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27)
SELECT * FROM `produks` WHERE `produks`.`produk_id` in (14, 29)
SELECT * FROM `users` WHERE `users`.`id` in (3, 9)
---
    public function index()
    {
        $feedbacks = Feedback::with(['user', 'produk', 'pertanyaan'])
            ->get()
            ->groupBy('user_id');

SELECT * FROM `feedback`
SELECT * FROM `pertanyaans` WHERE `pertanyaans`.`pertanyaan_id` in (13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27)
SELECT * FROM `produks` WHERE `produks`.`produk_id` in (14, 29)
SELECT * FROM `users` WHERE `users`.`id` in (3, 9)
---
    public function downloadpdf()
    {
        // nyoba semua tabel
        $data = Feedback::with('user','produk', 'pertanyaan')->get()->groupBy('user_id');