app/Http/Controllers/AdminPertanyaanController.php

SELECT * FROM `pertanyaans`
---
    public function index()
    {
        return view('dashboard.pertanyaans.index', [
            'pertanyaans' => Pertanyaan::all()
        ]);