app/Http/Controllers/AdminDashboardController.php

    public function dashboardHitung() {
        // Menghitung jumlah data di masing-masing tabel
        $feedbackCount = Feedback::count();
        $keywordCount = Keyword::count();
        $katblogCount = Category::count();
        $kontenblogCount = Post::count();
        $produkCount = Produk::count();
        $katprodCount = Katprod::count();
        $pertCount = Pertanyaan::count();
---
SELECT count(*) as aggregate FROM `feedback`
SELECT count(*) as aggregate FROM `keywords`
SELECT count(*) as aggregate FROM `categories`
SELECT count(*) as aggregate FROM `posts`
SELECT count(*) as aggregate FROM `produks`
SELECT count(*) as aggregate FROM `katprods`
SELECT count(*) as aggregate FROM `pertanyaans`