app/Http/Controllers/BerandaController.php

SELECT * FROM `produks` ORDER BY `created_at` DESC LIMIT 7
SELECT * FROM `katprods` WHERE `katprods`.`katprod_id` in (19, 21, 23, 24, 25, 26)
SELECT * FROM `produks` WHERE `produks`.`katprod_id` in (19, 21, 23, 24, 25, 26)
---
    public function index()
    {
        // Ambil data produk, misalnya produk terbaru
        $produks = Produk::latest()->take(7)->get();

        // Ambil kategori produk dengan relasi produk
        $katprods = Katprod::with('produk')->get();