app/Http/Controllers/DashboardPostController.php

SELECT * FROM `categories` WHERE `categories`.`category_id` in (48, 49, 50, 51, 52)
SELECT * FROM `posts` WHERE `user_id` = 2
SELECT * FROM `users` WHERE `users`.`id` in (2)
SELECT `keywords`.*, `post_keyword`.`post_id` as `pivot_post_id`, `post_keyword`.`keyword_id` as `pivot_keyword_id` FROM `keywords` inner join `post_keyword` on `keywords`.`keyword_id` = `post_keyword`.`keyword_id` WHERE `post_keyword`.`post_id` in (11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
---
    public function index()
    {
        // ambilkan data Post, yang userId sama dengan user yang lagi login
        // return view('dashboard.posts.index', [
        //     'posts' => Post::with('category', 'keywords')->where('user_id', auth()->user()->user_id)->get()
        // ]);
        return view('dashboard.posts.index', [
            'posts' => Post::with('category', 'keywords')->where('user_id', auth()->user()->id)->get()
        ]);

SELECT * FROM `categories` WHERE `categories`.`category_id` in (48, 49, 50, 51, 52)
SELECT * FROM `posts`
---
    public function downloadpdf()
    {
        // Ambil semua data post dengan category dan author
        $posts = Post::with(['category', 'author'])->get();