app/Http/Controllers/DashboardFeedbackController.php

    public function index()
    {
        $feedbacks = Feedback::with(['produk', 'pertanyaan', 'user'])->where('user_id', auth()->user()->id)->get();
---
SELECT * FROM `feedback` WHERE `user_id` = 3
SELECT * FROM `pertanyaans` WHERE `pertanyaans`.`pertanyaan_id` in (13, 14, 16, 17, 18, 19, 20)
SELECT * FROM `produks` WHERE `produks`.`produk_id` in (14)
SELECT * FROM `users` WHERE `users`.`id` in (3)

    public function create()
    {
        $produks = Produk::all();
        $pertanyaans = Pertanyaan::all();
---
SELECT * FROM `produks`
SELECT * FROM `pertanyaans`

    public function getPertanyaansByProduk($produkId)
    {
        $produk = Produk::find($produkId);
        $katprod_id = $produk->katprod_id;
        $pertanyaans = Pertanyaan::where('katprod_id', $katprod_id)->get();
---
SELECT * FROM `produks` WHERE `produks`.`produk_id` = '12' LIMIT 1
SELECT * FROM `katprods` WHERE `katprods`.`katprod_id` in (19)
SELECT * FROM `pertanyaans` WHERE `katprod_id` = 19