app/Http/Controllers/KatalogProdukController.php

    public function index()
    {
        $title = '';
        $mainCategoriesLimit = 3; // Batas kategori utama

        // Memfilter produk berdasarkan kategori jika ada
        if (request('katprod')) {
            $katprod = Katprod::firstWhere('slug', request('katprod'));
            $title = ' dengan Kategori ' . $katprod->namakatprod;
        }

        // Ambil semua kategori
        $katprods = Katprod::all();

        // Pisahkan kategori utama dan kategori tambahan
        $mainCategories = $katprods->take($mainCategoriesLimit);
        $additionalCategories = $katprods->slice($mainCategoriesLimit);

        return view('produks', [
            "title" => "Lilin Tiga Putra Sejahtera" . $title,
            "active" => 'produks',
            "produks" => Produk::latest()->filter(request(['search', 'katprod']))->paginate(7)->withQueryString(),
---
SELECT * FROM `katprods`
SELECT * FROM `katprods` WHERE `katprods`.`katprod_id` in (23, 24, 25, 26)
SELECT * FROM `produks` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT count(*) as aggregate FROM `produks`