app/Http/Controllers/LoginController.php

    public function authenticate(Request $request)
    {
        $credentials = $request->validate([
            'email' => 'required|email',
            'password' => 'required',
            'captcha' => 'required|captcha'
        ]);

        $credentials = $request->only('email', 'password');

        // Find the user by email
        $user = \App\Models\User::where('email', $credentials['email'])->first();
---
SELECT * FROM `users` WHERE `email` = 'dawn@gmail.com' LIMIT 1