app/Http/Controllers/PostController.php

    public function index()
    {
        $title = '';
        if(request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' dengan Kategori : ' . $category->name;
        }

        if(request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' oleh : ' . $author->name;
        }

        // Ambil kategori dan pisahkan kategori utama dan tambahan
        $allCategories = Category::all();
        $mainCategories = $allCategories->take(5); // Ambil 5 kategori utama
        $additionalCategories = $allCategories->skip(5); // Kategori sisanya

        return view('posts', [
            "title" => "Lilin Tiga Putra Sejahtera" . $title,
            "active" => 'posts',
            "posts" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(7)->withQueryString(),
            "mainCategories" => $mainCategories,
            "additionalCategories" => $additionalCategories
        ]);
---
SELECT * FROM `categories`
SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `categories` WHERE `categories`.`category_id` in (49, 50, 51, 52)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 7 offset 0
SELECT count(*) as aggregate FROM `posts`